app/views/movies/userlist.html.erb

        <td><%= link_to user.username, "/movies/userlist/#{user.id}"%></td>
        <td><%=Favorite.where(user_id: user.id).count%></td>
---
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]