app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
   @movies = Movie.find(params[:id])

INSERT INTO "movies" ("created_at", "updated_at", "name", "geners", "year", "director", "main_star", "description") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @movies = Movie.new(movies_params)
    if @movies.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 4]]
---
  def destroy
    @movies = Movie.find(params[:id])
    @movies.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @movies = Movie.find(params[:id])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "movies" SET "name" = $1, "geners" = $2, "updated_at" = $3 WHERE "movies"."id" = $4  [["name", "3 idiotsw"], ["geners", "Action"], ["updated_at", "2021-01-14 10:48:20.573159"], ["id", 8]]
---
  def update
    @movies = Movie.find(params[:id])
    if @movies.update(movies_params)

SELECT "users".* FROM "users"
---
  def userlist
    @users = User.all

SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = $1  [["user_id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def userfav
    @favorites = User.find(params[:user_id]).favorites